lib/tasks/clean.rake

    task :clean => :environment do |t, args|

        Invitation.destroy_all
        Tournament.destroy_all
        Leaderboard.destroy_all
        Match.destroy_all
        Phase.destroy_all
        PredictionSet.destroy_all
        Prediction.destroy_all
        Team.destroy_all
        Tournament.destroy_all
        User.destroy_all
---
DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 1]]
DELETE FROM "leaderboards" WHERE "leaderboards"."id" = $1  [["id", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]
DELETE FROM "phases" WHERE "phases"."id" = $1  [["id", 1]]
DELETE FROM "prediction_sets" WHERE "prediction_sets"."id" = $1  [["id", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]