lib/tasks/seed.rake

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "provider", "uid", "name", "picture", "image", "active", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."admin" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["email", "bryan.rivera@lognllc.com"], ["admin", true], ["LIMIT", 1]]
INSERT INTO "tournaments" ("code", "created_at", "updated_at", "active") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "WC22"], ["created_at", "2022-11-07 05:52:07.242946"], ["updated_at", "2022-11-07 05:52:07.242946"], ["active", true]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."code" = $1 ORDER BY "tournaments"."id" ASC LIMIT $2  [["code", "WC22"], ["LIMIT", 1]]
INSERT INTO "phases" ("code", "level", "small_points", "big_points", "active", "created_at", "updated_at", "tournament_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "phases".* FROM "phases" WHERE "phases"."code" = $1 AND "phases"."level" = $2 AND "phases"."small_points" = $3 AND "phases"."big_points" = $4 AND "phases"."active" = $5 AND "phases"."tournament_id" = $6 ORDER BY "phases"."id" ASC LIMIT $7  [["code", "A"], ["level", 1], ["small_points", 1], ["big_points", 3], ["active", true], ["tournament_id", 1], ["LIMIT", 1]]
INSERT INTO "teams" ("code", "group", "created_at", "updated_at", "tournament_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", "arg"], ["group", "C"], ["created_at", "2022-11-07 05:52:07.308358"], ["updated_at", "2022-11-07 05:52:07.308358"], ["tournament_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."code" = $1 AND "teams"."group" = $2 AND "teams"."tournament_id" = $3 ORDER BY "teams"."id" ASC LIMIT $4  [["code", "arg"], ["group", "C"], ["tournament_id", 1], ["LIMIT", 1]]
---
  task seed: :environment do |_t, _args|
    # Admins
    puts 'Creating default users...'
    DEFAULT_ADMINS.each do |user|
      User.where(email: user.email, admin: true).first_or_create
    end
    puts 'Users created'

    # Tournament
    tournament = Tournament.where(code: 'WC22').first_or_create

    # Phases
    puts 'Creating default phases...'
    DEFAULT_PHASES.each do |phase|
      Phase.where(
        code: phase.code,
        level: phase.level,
        small_points: phase.small_points,
        big_points: phase.big_points,
        active: phase.active,
        tournament: tournament
      ).first_or_create
    end
    puts 'Phases created'

    # Teams
    puts 'Creating default teams...'
    DEFAULT_TEAMS.each do |team|
      Team.where(code: team.code, group: team.group, tournament: tournament).first_or_create

SELECT "teams".* FROM "teams" WHERE "teams"."tournament_id" = $1  [["tournament_id", 1]]
SELECT "phases".* FROM "phases" WHERE "phases"."tournament_id" = $1  [["tournament_id", 1]]
---
    # Matches
    puts 'Creating default matches...'
    teams = tournament.teams.all
    phases = tournament.phases.all

SELECT "phases".* FROM "phases" WHERE "phases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      date = DateTime.parse(match.date)
      phase = phases.find { |phase| phase.code == match.phase }
      if match.team1 && match.team2
        team1 = teams.find { |team| team.code == match.team1 }

INSERT INTO "matches" ("number", "date", "phase_id", "team1_id", "team2_id", "team1_score", "team2_score", "team1_label", "team2_label", "ready", "created_at", "updated_at", "tournament_id", "is_closed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
          ready: false,
          tournament: tournament
        }
        Match.where(match_params).first_or_create

INSERT INTO "matches" ("number", "date", "phase_id", "team1_id", "team2_id", "team1_score", "team2_score", "team1_label", "team2_label", "ready", "created_at", "updated_at", "tournament_id", "is_closed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
          ready: false,
          tournament: tournament
        }
        Match.where(match_params).first_or_create