app/controllers/admin/users_controller.rb

UPDATE "users" SET "updated_at" = $1, "name" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-11-07 06:05:50.803052"], ["name", "ATEST"], ["id", 5]]
---
  def update
    @user.update(entity_parameters)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def load_entity_object
    @user = User.find(params[:id])

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def load_all_entity_objects
    @users = User.order(:name)