app/modules/group.rb

  def initialize
    group_codes = %w[A B C D E F G H]
    @data = []
    teams = Tournament.where(code: 'WC22').first.teams.all
    group_codes.each do |code|
      group_teams = []
      teams.each do |team|
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."code" = $1 ORDER BY "tournaments"."id" ASC LIMIT $2  [["code", "WC22"], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."tournament_id" = $1  [["tournament_id", 1]]

  def process_team(team)
    phases = Phase.where(level: 1).pluck(:id)
    home_games = Match.where(team1: team.id, phase_id: phases)
    visit_games = Match.where(team2: team.id, phase_id: phases)
    matches_played = goal_in_favor = goal_against = points = win = draw = lost = 0
    home_games.each do |home|
      next unless home.closed?
      next unless home.valid_scores?
      matches_played += 1
      goal_in_favor += home.team1_score
      goal_against += home.team2_score
      if home.tie?
        points += 1
        draw += 1
      elsif home.team1_win?
        points += 3
        win += 1
      else
        lost += 1
      end
    end
    visit_games.each do |visit|
---
SELECT "phases"."id" FROM "phases" WHERE "phases"."level" = $1  [["level", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."team1_id" = $1 AND "matches"."phase_id" IN ($2, $3, $4, $5, $6, $7, $8, $9)  [["team1_id", 10], ["phase_id", 1], ["phase_id", 2], ["phase_id", 3], ["phase_id", 4], ["phase_id", 5], ["phase_id", 6], ["phase_id", 7], ["phase_id", 8]]
SELECT "matches".* FROM "matches" WHERE "matches"."team2_id" = $1 AND "matches"."phase_id" IN ($2, $3, $4, $5, $6, $7, $8, $9)  [["team2_id", 10], ["phase_id", 1], ["phase_id", 2], ["phase_id", 3], ["phase_id", 4], ["phase_id", 5], ["phase_id", 6], ["phase_id", 7], ["phase_id", 8]]