app/modules/position_board.rb

SELECT "users".* FROM "users" INNER JOIN "leaderboards_users" ON "users"."id" = "leaderboards_users"."user_id" WHERE "leaderboards_users"."leaderboard_id" = $1 AND "users"."active" = $2  [["leaderboard_id", 1], ["active", true]]
SELECT "prediction_sets".* FROM "prediction_sets" WHERE "prediction_sets"."tournament_id" = $1 AND "prediction_sets"."user_id" IN ($2, $3)  [["tournament_id", 1], ["user_id", 2], ["user_id", 3]]
---
  def prediction_sets
    active_users = leaderboard ? leaderboard.users.active.map(&:id) : User.where(active: true).map(&:id)
    @prediction_sets ||=
      PredictionSet.where(tournament: wc22, user_id: active_users).includes(:user)
                   .select { |set| valid_predictions?(set) }

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."code" = $1 ORDER BY "tournaments"."id" ASC LIMIT $2  [["code", "WC22"], ["LIMIT", 1]]
---
  def wc22
    @wc22 ||= Tournament.where(code: 'WC22').first