app/modules/stats.rb

SELECT "predictions".* FROM "predictions" INNER JOIN "matches" ON "matches"."id" = "predictions"."match_id" WHERE "predictions"."match_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64) ORDER BY matches.date
---
  def matches
    @matches ||= wc22.matches.includes(:predictions).all

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."code" = $1 ORDER BY "tournaments"."id" ASC LIMIT $2  [["code", "WC22"], ["LIMIT", 1]]
---
  def wc22
    @wc22 ||= Tournament.where(code: 'WC22').first