app/views/shared/_navbar.html.erb

SELECT COUNT(*) FROM "invitations" WHERE "invitations"."user_id" = $1  [["user_id", 3]]
---
                <span class="glyphicon glyphicon-cog"></span>
                <% if current_user.invitations.size > 0 %>