app/controllers/application_controller.rb

SELECT 1 AS one FROM "prediction_sets" WHERE "prediction_sets"."user_id" = $1 AND "prediction_sets"."tournament_id" = $2 LIMIT $3  [["user_id", 3], ["tournament_id", 1], ["LIMIT", 1]]
---
  def after_sign_in_path_for(user)
    if !PredictionSet.exists?(user: user, tournament: gc19)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."code" = $1 ORDER BY "tournaments"."id" ASC LIMIT $2  [["code", "WC22"], ["LIMIT", 1]]
---
  def gc19
    @gc19 ||= Tournament.where(code: 'WC22').first