app/controllers/authentication_controller.rb

  def find_user_by_provider
    User.where(provider: auth.provider, uid: auth.uid, email: auth.info.email).first_or_create
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "provider", "uid", "name", "picture", "image", "active", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 AND "users"."email" = $3 ORDER BY "users"."id" ASC LIMIT $4  [["provider", "google_oauth2"], ["uid", "109010219257076336433"], ["email", "andrez47@gmail.com"], ["LIMIT", 1]]

  def find_user_by_email
    User.where(email: auth.info.email).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "andrez47@gmail.com"], ["LIMIT", 1]]

  def authorize
    user.update(user_info)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "[FILTERED]"], ["updated_at", "2022-11-07 05:59:17.092624"], ["id", 3]]