app/controllers/leaderboards_controller.rb

  def index
    @general_board ||= PositionBoard.new
    @boards = current_user.leaderboards.map { |leaderboard| PositionBoard.new(leaderboard) }
---
SELECT "leaderboards".* FROM "leaderboards" INNER JOIN "leaderboards_users" ON "leaderboards"."id" = "leaderboards_users"."leaderboard_id" WHERE "leaderboards_users"."user_id" = $1  [["user_id", 3]]

  def create
    leaderboard_params = parameters
    leaderboard_params[:owner_id] = current_user.id
    @leaderboard = Leaderboard.create(leaderboard_params)
    if @leaderboard
      @leaderboard.code = SecureRandom.uuid
      @leaderboard.users << current_user
      @leaderboard.save
---
INSERT INTO "leaderboards" ("name", "code", "owner_id", "active", "private", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "TEST"], ["code", nil], ["owner_id", 3], ["active", true], ["private", true], ["created_at", "2022-11-07 05:58:01.789652"], ["updated_at", "2022-11-07 05:58:01.789652"]]
UPDATE "leaderboards" SET "code" = $1, "updated_at" = $2 WHERE "leaderboards"."id" = $3  [["code", "5c5f75cf-dd74-4797-8c32-e2a7312c8ced"], ["updated_at", "2022-11-07 05:58:01.797805"], ["id", 1]]

  def edit
    @leaderboard = Leaderboard.find(params[:id])
---
SELECT "leaderboards".* FROM "leaderboards" WHERE "leaderboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def load_leaderboard
    @leaderboard ||= Leaderboard.find(params[:id])
---
SELECT "leaderboards".* FROM "leaderboards" WHERE "leaderboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]