app/controllers/predictions_controller.rb

SELECT "phases".* FROM "phases" WHERE "phases"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13)  [["id", 1], ["id", 2], ["id", 4], ["id", 3], ["id", 6], ["id", 5], ["id", 7], ["id", 8], ["id", 9], ["id", 10], ["id", 11], ["id", 12], ["id", 13]]
---
  def index
    @prediction_set =
      PredictionSet
        .where(user: current_user, tournament: gc19)
        .includes(predictions: { match: [:team1, :team2, :phase] })
        .first

SELECT "prediction_sets".* FROM "prediction_sets" WHERE "prediction_sets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @prediction_set = PredictionSet.find(params[:id])

UPDATE "predictions" SET "score1" = $1, "score2" = $2, "updated_at" = $3 WHERE "predictions"."id" = $4  [["score1", 1], ["score2", 1], ["updated_at", "2022-11-07 05:56:53.740750"], ["id", 1]]
---
  def update
    if prediction_set.update(prediction_set_params)

SELECT "prediction_sets".* FROM "prediction_sets" WHERE "prediction_sets"."id" = $1 ORDER BY "prediction_sets"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def prediction_set
    @prediction_set ||= PredictionSet.where(id: params[:id]).first